app/controllers/tasks_controller.rb

  def todo
    @user_id = current_user.id
    @tasks = Task.where(done: false, user_id: @user_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = ? AND "tasks"."user_id" = ?  [["done", "f"], ["user_id", 1]]

  def done
    @user_id = current_user.id
    @tasks = Task.where(done: true, user_id: @user_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = ? AND "tasks"."user_id" = ?  [["done", "t"], ["user_id", 1]]

  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "done", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "uyewqyure"], ["description", "hfsakfkjasdhfkjsdhfjk"], ["done", "t"], ["user_id", 1], ["created_at", "2019-04-10 23:50:40.162535"], ["updated_at", "2019-04-10 23:50:40.162535"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "description" = ?, "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "niver luiza "], ["done", "t"], ["updated_at", "2019-04-11 16:58:54.425828"], ["id", 10]]